
<!DOCTYPE html>

<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
  <title>Los Tres Pilares de la Web</title>
 
</head>

<body>

<h1>Los Tres Pilares de la Web</h1>
<p><a href="http://es.wikipedia.org/wiki/Tim_Berners-Lee">Tim Berners-Lee</a> es considerado el padre de la Web porque desarroll&oacute; los tres elementos b&aacute;sicos para el funcionamiento de la <a href=" http://es.wikipedia.org/wiki/World_Wide_Web">Web</a>:</p>
<ul>
<li><a href="#jaz">HTML</a></li>
<li><a href="#jazu">HTTP</a></li>
<li><a href="#jazua">URL</a></li>
</ul>
<h1><a id="jaz"></a>HTML</h1>
<p>HTML, siglas de <strong>HyperText Markup Language</strong>, hace referencia al lenguaje de marcado para la elaboraci&oacute;n de p&aacute;ginas web. Es un est&aacute;ndar que sirve de referencia para la elaboraci&oacute;n de p&aacute;ginas web en sus diferentes versiones, define una estructura b&aacute;sica y un c&oacute;digo (denominado c&oacute;digo HTML) para la definici&oacute;n de contenido de una p&aacute;gina web, como texto, im&aacute;genes, entre otros. Es un est&aacute;ndar a cargo de la W3C, organizaci&oacute;n dedicada a la estandarizaci&oacute;n de casi todas las tecnolog&iacute;as ligadas a la web, sobre todo en lo referente a su escritura e interpretaci&oacute;n. Es el lenguaje con el que se definen las p&aacute;ginas web.</p>
<p>Fuente:<a href=" http://es.wikipedia.org/wiki/HTML"> HTML</a>, Wikipedia</p>
 
<h1><a id="jazu"></a>HTTP</h1>
<strong>Hypertext Transfer Protocol</strong> o HTTP (en espa&ntilde;ol protocolo de transferencia de hipertexto) es el protocolo usado en cada transacci&oacute;n de la World Wide Web. HTTP fue desarrollado por el World Wide Web Consortium y la Internet Engineering Task Force, colaboraci&oacute;n que culmin&oacute; en 1999 con la publicaci&oacute;n de una serie de RFC, el m&aacute;s importante de ellos es el RFC 2616 que especifica la versi&oacute;n 1.1.</p>
<p>Fuente: <a href="http://es.wikipedia.org/wiki/Hypertext_Transfer_Protocol">HTTP</a>, Wikipedia</p>
 
<h1><a id="jazua"></a>URL</h1>
<p>Un <strong>localizador de recursos uniforme</strong> o URL &#45;siglas en ingl&eacute;s de <em>Uniform Resource Locator</em> &#45; es un identificador de recursos uniforme (URI) cuyos recursos referidos pueden cambiar, esto es, la direcci&oacute;n puede apuntar a recursos variables en el tiempo. Est&aacute;n formados por una secuencia de caracteres, de acuerdo a un formato mod&eacute;lico y est&aacute;ndar, que designa recursos en una red, como Internet.</p>
<p>Fuente: <a href=" http://es.wikipedia.org/wiki/Localizador_de_recursos_uniforme">URL</a>, Wikipedia</p>
</body>
</html>
